{
    "experiences" : [
        {
            "company":"BAIR - Berkeley Speech Group",
            "position":"LLM Interpretability Researcher",
            "description": [
                "Researching interpretability and faithfulness of frontier reasoning models.",
                "Employing \"logitlens\" view of transformers to analyze internal reasoning and decision making of LLM models",
                "Engineering with openAI APIs to finetune, prompt, and collect sample data from Llama, Deepseek, Qwen, and OpenAI models."
            ],
            "years": "May 2025 - Present",
            "picture": "/img/BAIR_Logo.svg"
        },
        {
            "company":"UCSF Weill Institute for Neurosciences",
            "position":"Machine Learning Researcher",
            "description": [
                "Developed EEG signal processing pipeline to accurately detect seizure patterns in epileptic mice",
                "Created and Fine-tuned SVM model to accurately classify mice seizures with 96% accuracy",
                "Integrating state-of-the-art video analysis tools (DeepLabCut and Keypoint Moseq) to track and quantify behavioral patterns."
            ],
            "years": "Jan 2025 - Present",
            "picture": "/img/UCSF_logo.png"
        },
        {
            "company":"SwiftScore LLC",
            "position":"Fullstack Developer",
            "description": [
                "Develop full-stack LMS solutions for educators with React, Typescript, and Database Management Systems (Supabase).",
                "Work closely with AI engineers to study how to implement and deploy LLM algorithms from scratch (Tensorflow).",
                "Implemented RESTful APIs with prompt engineering techniques to utilize output from LLM models."
            ],
            "years": "Aug 2024 - Jan 2025",
            "picture": "/img/swiftscore.png"
        },
        {
            "company":"San Diego State University",
            "position":"AI Researcher",
            "description": [
                "Optimized erythrocyte detection algorithm by 10% through layering the CLAHE model on the developmental UNet Model.",
                "Developed computer vision model with the Pytorch and Keras framework to detect blood capillaries and cells.",
                "Implemented Contrast Limited Adaptive Histogram Equalization with OpenCV to create binary image masks for training."
            ],
            "years": "May 2022 - Sept 2022",
            "picture": "/img/sdsu_logo-1.png"
        },
        {
            "company":"Franklin Research Internship Program",
            "position":"Machine Learning Intern",
            "description": [
                "Mentored by Penn State Professor in regression, classification, and other unsupervised learning algorithms.",
                "Implemented 10+ (KNN, SlopeOne, Logistic Regression, etc.) content recommendation algorithms with Sci-kit learn.",
                "Compared accuracy (ranging from 70-90%) of ML systems by analyzing RMSE metrics. Documented findings within paper."
            ],
            "years": "May 2021 - July 2021",
            "picture": "/img/ai.webp"
        }
    ]
}